'''Задача 1
Строка представляет собой арифметическое выражение из однозначных чисел и знаков + и -.
Вычислите результат.
Пример
Ввод

8-5+2-1
Вывод
4'''

# summ = list(input())
# res = int(summ[0])
# for i in range(1, len(summ) - 1, 2):
#     if summ[i] == '+':
#         res += int(summ[i + 1])
#     else:
#         res -= int(summ[i + 1])
# print(res)

'''Задача 2
Словом в данной задаче считается последовательность букв, ограниченная пробелами 
или началом или концом строки.
Выведите все слова из строки в столбик. НЕЛЬЗЯ ПОЛЬЗОВАТЬСЯ МЕТОДАМИ СТРОК (split)

Формат ввода
Вводится строка.

Формат вывода
Выведите слова из строки по одному.

Пример 1
Ввод

Hello, world!
Вывод
Hello,
world!
Пример 2
Ввод

My heart in the Highland
Вывод
My
heart
in
the
Highland'''

# s = list(input())
# for i in s:
#     if i != ' ':
#         print(i, end='')
#     else:
#         print()






